20220214170817-zero_inflated_negative_binomial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-29 Sat 15:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Zero-inflated Negative Binomial</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Zero-inflated Negative Binomial</h1>
<p>
The Zero-inflated <a href="20210420200526-negative_binomial_distribution.html#ID-273bfd3a-7e6e-4971-b422-048f930ae5b0">Negative Binomial</a> (ZINB) model adresses both zero inflation and overdispersion in the data. It can be expressed as:
</p>

\begin{equation*}
 X_j \sim (1-\pi_j)\; \mathds{1}_{w_j=0} + \pi_j\; \operatorname{NegativeBinomial}(\mu_j, r)
\end{equation*}

<p>
where the \(w_j\) are indivicator variables such that \(w_j=x_j=0\) with probability \(1-\pi_j\) and \(w_j=1\) with probability \(\pi_j\). We typically model the \(w_j\) using a logistic model.
</p>

<div id="outline-container-org7faac22" class="outline-2">
<h2 id="org7faac22">Sample</h2>
<div class="outline-text-2" id="text-org7faac22">
<p>
We can use the method described in to sample the ZINB model with a logistic mode:
</p>

<ol class="org-ol">
<li>Use the Gibbs sampler in to sample the parameter of the logistic regression model;</li>
<li>Use the Gibbs sampler in  to sample the parameter of the negative binomial;</li>
<li>Update \(r\) using a MCMC step;</li>
<li>Update the \(w_j\) from their discrete full conditional distributions.</li>
</ol>
</div>
</div>


<div id="outline-container-orgcab5001" class="outline-2">
<h2 id="orgcab5001">Links to this note</h2>
</div>
</div>
</body>
</html>